---
kind: other
id: Methods.T:Autodesk.Revit.DB.SunAndShadowSettings
source: html/7669ee83-97d5-7f84-e14c-78bc4bdf3456.htm
---
# SunAndShadowSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.